# HorizontalImageOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayBackground..::..HorizontalImageOffset Property
ViewDisplayBackground Class See Also
---
The distance between the left viewport boundary and the left edge of the background image.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double HorizontalImageOffset { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HorizontalImageOffset As Double
	Get
```

Visual C++
---
```text
public:
property double HorizontalImageOffset {
	double get ();
}
```

# See Also
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace